INSERT INTO categories (name, alias) VALUES
('ЖКХ', 'ЖКХ'),
('Хоз расходы', 'хоз'),
('Телефон', 'тел'),
('Продукты', 'прод еда'),
('Готовая еда', 'гот'),
('Еда вне дома', 'ндом мак'),
('Одежда', 'од'),
('Питомцы', 'пит'),
('Канцилярия', 'канц'),
('Игрушки', 'игр'),
('Салоны\Косметика', 'кр'),
('Трансопрт', 'тр'),
('Здоровье', 'зд');

INSERT INTO expenses (date, amount, category_id) VALUES
('2025-08-01', 1200, 1),   -- ЖКХ
('2025-08-01', 350, 4),    -- Продукты
('2025-08-01', 500, 5),    -- Готовая еда
('2025-08-02', 200, 2),    -- Хоз расходы
('2025-08-02', 150, 4),    -- Продукты
('2025-08-02', 700, 6),    -- Еда вне дома
('2025-08-03', 100, 3),    -- Телефон
('2025-08-03', 400, 4),    -- Продукты
('2025-08-03', 250, 8),    -- Питомцы
('2025-08-04', 800, 1),    -- ЖКХ
('2025-08-04', 300, 5),    -- Готовая еда
('2025-08-04', 120, 9),    -- Канцилярия
('2025-08-05', 600, 4),    -- Продукты
('2025-08-05', 450, 7),    -- Одежда
('2025-08-05', 200, 10),   -- Игрушки
('2025-08-06', 300, 4),    -- Продукты
('2025-08-06', 100, 11),   -- Салоны\Косметика
('2025-08-06', 500, 12),   -- Трансопрт
('2025-08-07', 250, 4),    -- Продукты
('2025-08-07', 350, 13),   -- Здоровье
('2025-08-07', 400, 6),    -- Еда вне дома
('2025-08-08', 700, 1),    -- ЖКХ
('2025-08-08', 150, 4),    -- Продукты
('2025-08-08', 200, 8),    -- Питомцы
('2025-08-09', 500, 5),    -- Готовая еда
('2025-08-09', 300, 4),    -- Продукты
('2025-08-09', 100, 12),   -- Трансопрт
('2025-08-10', 400, 4),    -- Продукты
('2025-08-10', 250, 2),    -- Хоз расходы
('2025-08-11', 600, 4);    -- Продукты
